---
kind: property
id: P:Autodesk.Revit.DB.Opening.BoundaryCurves
source: html/48230156-1a98-ed16-3983-babdfc0ded18.htm
---
# Autodesk.Revit.DB.Opening.BoundaryCurves Property

The geometry information for non-rectangular openings in project documents,
or for all openings in family documents.

## Syntax (C#)
```csharp
public CurveArray BoundaryCurves { get; }
```

## Remarks
If IsRectBoundary is true, this value is Nothing nullptr a null reference ( Nothing in Visual Basic) .